local platinum_01_description = [[
	Если вы хотите выразить благодарность за нашу работу, тогда Platinum это отличный вариант.
	Когда купите его, можете связаться с нами и получить специальную роль и доступ к закрытым каналам в дискорде.
	Открывает доступ к:


	- Лимит пропов 100
	- Время возрождения 10-20 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Маскировка «C82.MPF.OFC» и «Фасовщик ГСР»
	- Взлом кейпадов быстрее на 15 секунд
	- Работа «C82.OTA.KING» с покупкой
	- Работа «G-Man» с покупкой


	Gold
	- Работа «C82.OTA.HEAVY» без покупки
	- Работа «C82.OTA.SOW» без покупки
	- Работа «C82.OTA.ASSASSIN» без покупки
	- Работа «Сержант HECU» без покупки
	- Работа «Шпион HECU» с покупкой


	Silver
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

local platinum_02_description = [[
	Если вы хотите выразить благодарность за нашу работу, тогда Platinum это отличный вариант.
	Когда купите его, можете связаться с нами и получить специальную роль и доступ к закрытым каналам в дискорде.
	Эта опция даёт три месяца Platinum по цене двух.
	Открывает доступ к:


	- Лимит пропов 100
	- Время возрождения 10-20 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Маскировка «C82.MPF.OFC» и «Фасовщик ГСР»
	- Взлом кейпадов быстрее на 15 секунд
	- Работа «C82.OTA.KING» с покупкой
	- Работа «G-Man» с покупкой


	Gold
	- Работа «C82.OTA.HEAVY» без покупки
	- Работа «C82.OTA.SOW» без покупки
	- Работа «C82.OTA.ASSASSIN» без покупки
	- Работа «Сержант HECU» без покупки
	- Работа «Шпион HECU» с покупкой


	Silver
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

local platinum_03_description = [[
	Если вы хотите выразить благодарность за нашу работу, тогда Platinum это отличный вариант.
	Когда купите его, можете связаться с нами и получить специальную роль и доступ к закрытым каналам в дискорде.
	Эта опция даёт Platinum навсегда по цене трёх месяцев.
	Открывает доступ к:


	- Лимит пропов 100
	- Время возрождения 10-20 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Маскировка «C82.MPF.OFC» и «Фасовщик ГСР»
	- Взлом кейпадов быстрее на 15 секунд
	- Работа «C82.OTA.KING» с покупкой
	- Работа «G-Man» с покупкой


	Gold
	- Работа «C82.OTA.HEAVY» без покупки
	- Работа «C82.OTA.SOW» без покупки
	- Работа «C82.OTA.ASSASSIN» без покупки
	- Работа «Сержант HECU» без покупки
	- Работа «Шпион HECU» с покупкой


	Silver
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

local gold_01_description = [[
	Gold это золотая середина, пожалуй, самый лучший вариант для вас.
	Открывает доступ к:


	- Лимит пропов 80
	- Время возрождения 20-30 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Взлом кейпадов быстрее на 10 секунд
	- Работа «C82.OTA.HEAVY» без покупки
	- Работа «C82.OTA.SOW» без покупки
	- Работа «C82.OTA.ASSASSIN» без покупки
	- Работа «Сержант HECU» без покупки
	- Работа «Шпион HECU» с покупкой


	Silver
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

local gold_02_description = [[
	Gold это золотая середина, пожалуй, самый лучший вариант для вас.
	Эта опция даёт три месяца Gold по цене двух.
	Открывает доступ к:


	- Лимит пропов 80
	- Время возрождения 20-30 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Взлом кейпадов быстрее на 10 секунд
	- Работа «C82.OTA.HEAVY» без покупки
	- Работа «C82.OTA.SOW» без покупки
	- Работа «C82.OTA.ASSASSIN» без покупки
	- Работа «Сержант HECU» без покупки
	- Работа «Шпион HECU» с покупкой


	Silver
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

local gold_03_description = [[
	Gold это золотая середина, пожалуй, самый лучший вариант для вас.
	Эта опция даёт Gold навсегда по цене трёх месяцев.
	Открывает доступ к:


	- Лимит пропов 80
	- Время возрождения 20-30 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Взлом кейпадов быстрее на 10 секунд
	- Работа «C82.OTA.HEAVY» без покупки
	- Работа «C82.OTA.SOW» без покупки
	- Работа «C82.OTA.ASSASSIN» без покупки
	- Работа «Сержант HECU» без покупки
	- Работа «Шпион HECU» с покупкой


	Silver
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

local silver_01_description = [[
	Это бюджетный вариант, который подойдёт большинству игроков.
	Открывает доступ к:


	- Лимит пропов 60
	- Время возрождения 30-40 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Взлом кейпадов быстрее на 5 секунд
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

local silver_02_description = [[
	Это бюджетный вариант, который подойдёт большинству игроков.
	Эта опция даёт три месяца Silver по цене двух.
	Открывает доступ к:


	- Лимит пропов 60
	- Время возрождения 30-40 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Взлом кейпадов быстрее на 5 секунд
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

local silver_03_description = [[
	Это бюджетный вариант, который подойдёт большинству игроков.
	Эта опция даёт Silver навсегда по цене трёх месяцев.
	Открывает доступ к:


	- Лимит пропов 60
	- Время возрождения 30-40 секунд
	- Значок в списке игроков
	- Большой денежный принтер
	- Взлом кейпадов быстрее на 5 секунд
	- Работа «C82.MPF.OWD» с покупкой
	- Работа «Скаут Сопротивления» с покупкой
	- Работа «Командир HECU» с покупкой


	* Если купите другую привилегию, то старая возвращена не будет
	* Если написано «с покупкой», то работу нужно будет покупать за токены
	* После окончания привилегии вы не сможете больше занимать работы,
	но при восстановлении покупать второй раз работы будет не нужно
]]

--[[------------------------------------------------------------

	platinum

------------------------------------------------------------]]--
local platinum_01 = IGS("Platinum на 1 месяц", "platinum_01")
platinum_01:SetDescription(platinum_01_description)
platinum_01:SetPrice(899)
platinum_01:SetTerm(0)
platinum_01:SetCategory("Привилегии")
platinum_01:SetStackable(true)
platinum_01:SetOnActivate(function(ply) ply:sam_set_rank("platinum", 43800) end)

local platinum_02 = IGS("Platinum на 3 месяца", "platinum_02")
platinum_02:SetDescription(platinum_02_description)
platinum_02:SetPrice(1799)
platinum_02:SetTerm(0)
platinum_02:SetCategory("Привилегии")
platinum_02:SetStackable(true)
platinum_02:SetOnActivate(function(ply) ply:sam_set_rank("platinum", 131400) end)

local platinum_03 = IGS("Platinum навсегда", "platinum_03")
platinum_03:SetDescription(platinum_03_description)
platinum_03:SetPrice(2699)
platinum_03:SetTerm(0)
platinum_03:SetCategory("Привилегии")
platinum_03:SetStackable(true)
platinum_03:SetOnActivate(function(ply) ply:sam_set_rank("platinum") end)

--[[------------------------------------------------------------

	gold

------------------------------------------------------------]]--
local gold_01 = IGS("Gold на 1 месяц", "gold_01")
gold_01:SetDescription(gold_01_description)
gold_01:SetPrice(499)
gold_01:SetTerm(0)
gold_01:SetCategory("Привилегии")
gold_01:SetStackable(true)
gold_01:SetOnActivate(function(ply) ply:sam_set_rank("gold", 43800) end)

local gold_02 = IGS("Gold на 3 месяца", "gold_02")
gold_02:SetDescription(gold_02_description)
gold_02:SetPrice(999)
gold_02:SetTerm(0)
gold_02:SetCategory("Привилегии")
gold_02:SetStackable(true)
gold_02:SetOnActivate(function(ply) ply:sam_set_rank("gold", 131400) end)

local gold_03 = IGS("Gold навсегда", "gold_03")
gold_03:SetDescription(gold_03_description)
gold_03:SetPrice(1499)
gold_03:SetTerm(0)
gold_03:SetCategory("Привилегии")
gold_03:SetStackable(true)
gold_03:SetOnActivate(function(ply) ply:sam_set_rank("gold") end)

--[[------------------------------------------------------------

	silver

------------------------------------------------------------]]--
local silver_01 = IGS("Silver на 1 месяц", "silver_01")
silver_01:SetDescription(silver_01_description)
silver_01:SetPrice(100)
silver_01:SetTerm(0)
silver_01:SetCategory("Привилегии")
silver_01:SetStackable(true)
silver_01:SetOnActivate(function(ply) ply:sam_set_rank("silver", 43800) end)

local silver_02 = IGS("Silver на 3 месяца", "silver_02")
silver_02:SetDescription(silver_02_description)
silver_02:SetPrice(200)
silver_02:SetTerm(0)
silver_02:SetCategory("Привилегии")
silver_02:SetStackable(true)
silver_02:SetOnActivate(function(ply) ply:sam_set_rank("silver", 131400) end)

local silver_03 = IGS("Silver навсегда", "silver_03")
silver_03:SetDescription(silver_03_description)
silver_03:SetPrice(300)
silver_03:SetTerm(0)
silver_03:SetCategory("Привилегии")
silver_03:SetStackable(true)
silver_03:SetOnActivate(function(ply) ply:sam_set_rank("silver") end)

--[[------------------------------------------------------------

	Money

------------------------------------------------------------]]--
local money = IGS.NewGroup("Игровая валюта")

local money_01 = IGS("100,000 т", "money_01")
money_01:SetDarkRPMoney(100000)
money_01:SetPrice(50)
money:AddItem(money_01)

local money_02 = IGS("200,000 т", "money_02")
money_02:SetDarkRPMoney(200000)
money_02:SetPrice(100)
money:AddItem(money_02)

local money_03 = IGS("500,000 т", "money_03")
money_03:SetDarkRPMoney(500000)
money_03:SetPrice(250)
money:AddItem(money_03)

local money_04 = IGS("1,000,000 т", "money_04")
money_04:SetDarkRPMoney(1000000)
money_04:SetPrice(500)
money:AddItem(money_04)

local money_05 = IGS("2,000,000 т (-10%)", "money_05")
money_05:SetDarkRPMoney(2000000)
money_05:SetPrice(900)
money:AddItem(money_05)

local money_06 = IGS("5,000,000 т (-20%)", "money_06")
money_06:SetDarkRPMoney(5000000)
money_06:SetPrice(2000)
money:AddItem(money_06)

local money_07 = IGS("10,000,000 т (-30%)", "money_07")
money_07:SetDarkRPMoney(10000000)
money_07:SetPrice(3500)
money:AddItem(money_07)

local money_08 = IGS("20,000,000 т (-40%)", "money_08")
money_08:SetDarkRPMoney(20000000)
money_08:SetPrice(6000)
money:AddItem(money_08)